//Здарова
// 1. Що таке C#?

// C# (Сі Шарп) - це мова програмування, яка використовується для 
// створення різноманітних програм, від простих застосунків до складних ігор і веб-сайтів.
// C# розроблена компанією Microsoft і працює на платформі .NET.

// ———————————————————————————————————————————

// 2. Змінні та типи даних

// Змінні - це «коробочки», у яких зберігаються дані. 
//Наприклад, число, текст або булеве значення (істина чи брехня).

// Типи даних - визначають, який тип інформації буде зберігатися у змінній

int age = 25; // Змінна, що зберігає вік
double height = 1.75; // Змінна, що зберігає зріст
bool isStudent = true; // Змінна, що зберігає істину або брехню
char grade = 'A'; // Змінна, що зберігає оцінку
string name = "Anna"; // Змінна, що зберігає ім'я

// ————————————————————————————————————————

// 3. Операції та оператори

// 3.1 Арифметичні операції - використовуються для обчислень:
int sum = 5 + 3; // додавання: 5 + 3 буде 8
int difference = 5 - 3; // віднімання: 5 - 3 буде 2
int product = 5 * 3; // множення: 5 * 3 буде 15
int quotient = 10 / 2; // ділення: 10 / 2 буде 5
int remainder = 10 % 3; // залишок від ділення: 10 % 3 буде 1

// 3.2 Логічні операції - використовуються для порівняння:
bool isEqual = 5 == 5; // перевірка на рівність: 5 == 5 буде true
bool isNotEqual = 5 != 3; // перевірка на нерівність: 5 != 3 буде true
bool isGreaterThan = 5 > 3; // більше: 5 > 3 буде true
bool isLessThan = 5 < 3; // менше: 5 < 3 буде false
bool isGreaterOrEqual = 5 >= 5; // більше або дорівнює: 5 >= 5 буде true
bool isLessOrEqual = 3 <= 5; // менше або дорівнює: 3 <= 5 буде true

// ————————————————————————————————————————

// 4. Умовні Конструкції

// 4.1 else if
int userAge = Convert.ToInt32(Console.ReadLine());
if (userAge > 18)
{
    Console.WriteLine("Вам можно водить машину.");
}
else if (userAge == 18)
{
    Console.WriteLine("Вам как раз можно водить машину.");
}
else
{
    Console.WriteLine("Вам нельзя водить машину.");
}

// 4.2 switch - case

// switch — це умовна конструкція, 
// яка дозволяє перевіряти змінну на рівність кільком можливим значенням і 
// виконувати відповідний блок коду для кожного значення. 
// Це альтернатива ланцюжку if-else if, коли потрібно перевірити змінну
// на кілька можливих значень.  

System.Console.WriteLine("Enter number of day");
int day = int.Parse(Console.ReadLine());

switch (day)
{
    case 1:
        Console.WriteLine("Понеділок");
        break;

    case 2:
        Console.WriteLine("Вівторок");
        break;

    case 3:
        Console.WriteLine("Середа");
        break;

    case 4:
        Console.WriteLine("Четвер");
        break;

    case 5:
        Console.WriteLine("П’ятниця");
        break;

    case 6:
        Console.WriteLine("Субота");
        break;

    case 7:
        Console.WriteLine("Неділя");
        break;

    default: //Аналог else  
        Console.WriteLine("Невірний день тижня");
        break;
}

// 5. Цикли 
// Цикли дозволяють виконувати один і той же блок коду кілька разів,
//поки виконується певна умова.

// 5.1 Цикл for
//Цикл for зазвичай використовується,
//коли відома точна кількість повторень.
for (int i = 1; i <= 5; i++)
{
    Console.WriteLine(i);   // Виведе 1, 2, 3, 4, 5
}

//Ініціалізація — виконується один раз на початку
//Умова — перевіряється перед кожною ітерацією.
//Якщо вона істинна, тіло циклу виконується.
//Інкремент/декремент — виконується після кожної ітерації 

// 5.2 Цикл while
int abc = 1;
while (abc <= 5)
{
    Console.WriteLine(abc++);   // Виведе 1, 2, 3, 4, 5
}

// 5.3 Цикл do while
abc = 1;
do
{
    Console.WriteLine(abc);   // Виведе 1, 2, 3, 4, 5
    abc++;
} while (abc <= 5);

// 6. Конвертація даних

// 6.1 Метод Convert
// Методи класу Convert використовуються для
// явної конвертації між різними типами даних.

string numberString = "5"; // Перетворення строки в ціле число
int number = Convert.ToInt32(numberString);

// 6.2 Метод Parse
// Метод Parse перетворює рядок у відповідний тип даних, 
// якщо рядок має правильний формат.
// Якщо формат неправильний, викликається помилка.

numberString = "5"; // Перетворення строки в ціле число
number = int.Parse(numberString);

// 6.3 Метод TryParse
//Метод TryParse схожий на Parse,
// але замість виклику винятку, він повертає true або false залежно від того,
// чи вдалося конвертувати рядок у потрібний тип. Якщо конвертація успішна,
// значення присвоюється змінній, яку ви передали як параметр.

string numberString = "123";
bool success = int.TryParse(numberString, out int number); 
// success буде true, number = 123

string invalidString = "abc";
bool failed = int.TryParse(invalidString, out int invalidNumber);  
// failed буде false, invalidNumber = 0

// 7. Інкремент та декремент у C#

// Інкремент і декремент — це операції, 
// які дозволяють збільшувати або зменшувати значення змінної на одиницю.

int a = 2; a++; // 7.1 Інкремент (++) — збільшує значення змінної на 1.
int b = 2; b--; // 7.2 Декремент (--) — зменшує значення змінної на 1.

// 7.3 Префіксна форма (++i, --i):
// Спочатку збільшує/зменшує значення змінної,
// а потім повертає (використовує) нове значення.

// 7.4 Постфіксна форма (i++, i--):
// Cпочатку повертає (використовує) поточне значення змінної,
// а потім збільшує/зменшує її значення.